webapp2/server/src/main/java/isdcm/webapp2/services/BusquedaSOAP.xsd

<!-- Busqueda Video -->

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:SearchVideo>
			<q0:year></q0:year>
			<q0:month></q0:month>
			<q0:day></q0:day>
			<q0:title></q0:title>
			<q0:author></q0:author>
		</q0:SearchVideo>
	</soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:VideoList>
			<q0:Video>
				<title></title>
				<author></author>
				<duration></duration>
				<description></description>
				<format></format>
				<url></url>
				<id></id>
				<username></username>
			</q0:Video>
			<!-- Optional -->
			<q0:Video>
				...
			</q0:Video>
		</q0:VideoList>
	</soapenv:Body>
</soapenv:Envelope>

<!-- Busqueda Video por fecha creacion -->
<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:SearchbyFechaCreacion>
			<q0:year></q0:year>
			<q0:month></q0:month>
			<q0:day></q0:day>
		</q0:SearchbyFechaCreacion>
	</soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:VideoList>
			<q0:Video>
				<title></title>
				<author></author>
				<duration></duration>
				<description></description>
				<format></format>
				<url></url>
				<id></id>
				<username></username>
			</q0:Video>
			<!-- Optional -->
			<q0:Video>
				...
			</q0:Video>
		</q0:VideoList>
	</soapenv:Body>
</soapenv:Envelope>

<!-- Busqueda Video por autor -->
<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:SearchbyAuthor>
			<q0:author></q0:author>
		</q0:SearchbyAuthor>
	</soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:VideoList>
			<q0:Video>
				<title></title>
				<author></author>
				<duration></duration>
				<description></description>
				<format></format>
				<url></url>
				<id></id>
				<username></username>
			</q0:Video>
			<!-- Optional -->
			<q0:Video>
				...
			</q0:Video>
		</q0:VideoList>
	</soapenv:Body>
</soapenv:Envelope>

<!-- Busqueda Video por titulo -->
<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:SearchbyTitle>
			<q0:title></q0:title>
		</q0:SearchbyTitle>
	</soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:VideoList>
			<q0:Video>
				<title></title>
				<author></author>
				<duration></duration>
				<description></description>
				<format></format>
				<url></url>
				<id></id>
				<username></username>
			</q0:Video>
			<!-- Optional -->
			<q0:Video>
				...
			</q0:Video>
		</q0:VideoList>
	</soapenv:Body>
</soapenv:Envelope>

<!-- Busqueda My Video -->
<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:SearchMyVideos>
			<username></username>
		</q0:SearchMyVideos>
	</soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
	xmlns:q0="http://localhost:8080/server"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:VideoList>
			<q0:Video>
				<title></title>
				<author></author>
				<duration></duration>
				<description></description>
				<format></format>
				<url></url>
				<id></id>
				<username></username>
			</q0:Video>
			<!-- Optional -->
			<q0:Video>
				...
			</q0:Video>
		</q0:VideoList>
	</soapenv:Body>
</soapenv:Envelope>